&НаКлиенте
Процедура Рассчитать(Команда)
	
	// 1. Подготовка массива чисел
	МассивПодстрок = СтрРазделить(Объект.КартаВысот, ",", Ложь);
	Высоты = Новый Массив;
	
	Для Каждого Стр Из МассивПодстрок Цикл
		ТекЗначение = СокрЛП(Стр);
		Если ТекЗначение = "" Тогда Продолжить; КонецЕсли;
		Попытка
			Высоты.Добавить(Число(ТекЗначение));
		Исключение
			// Пропускаем мусор
		КонецПопытки;
	КонецЦикла;
	
	Кол = Высоты.Количество();
	Если Кол < 3 Тогда
		ПоказатьПредупреждение(, "Результат: 0");
		Возврат;
	КонецЕсли;

	// 2. Рассчитываем "пики" слева и справа
	ЛеваяСтена  = Новый Массив(Кол);
	ПраваяСтена = Новый Массив(Кол);
	
	// Заполняем Левую стену
	ЛеваяСтена[0] = Высоты[0];
	Для Индекс = 1 По Кол - 1 Цикл
		ЛеваяСтена[Индекс] = Макс(ЛеваяСтена[Индекс - 1], Высоты[Индекс]);
	КонецЦикла;
	
	// Заполняем Правую стену
	ПраваяСтена[Кол - 1] = Высоты[Кол - 1];
	Для Индекс = 1 По Кол - 1 Цикл
		ИндОбр = Кол - 1 - Индекс;
		ПраваяСтена[ИндОбр] = Макс(ПраваяСтена[ИндОбр + 1], Высоты[ИндОбр]);
	КонецЦикла;
	
	// 3. Считаем итоговую воду
	ИтогоВоды = 0;
	Для Индекс = 0 По Кол - 1 Цикл
		Уровень = Мин(ЛеваяСтена[Индекс], ПраваяСтена[Индекс]);
		ВодаВТочке = Уровень - Высоты[Индекс];
		Если ВодаВТочке > 0 Тогда
			ИтогоВоды = ИтогоВоды + ВодаВТочке;
		КонецЕсли;
	КонецЦикла;
	
	// 4. Финал
	ПоказатьПредупреждение(, "Количество улавливаемой воды: " + Формат(ИтогоВоды, "ЧГ=0"));
	
КонецПроцедуры
